//1

//  Напишите функцию JavaScript, которая переворачивает число. Перейти к редактору
// Пример х = 32243;
// Ожидаемый результат: 34223

// function funcReverse(a){
//   a+="";
//   a.split("").reverse().join("");
//   return a;
  
// }
// console.log(funcReverse(34223));

//2

// Составьте программу, которая принимает с клавиатуры целое число и, если оно положительное, увеличивает его вдвое.
// Программа должна выводить на экран новое значение.

// function foo(a){
//   if(a>0){
//     return a*2;
    
//   }
// }
// console.log(foo(22));

//3

// Составьте программу, которая принимает с клавиатуры целое число 
// и, если оно равно нулю, выводит на экран сообщение "ноль".


// function zeroNum(a){
//   if(a==0){
//  console.log('Ноль')
//   }
//   return a;
// }
// zeroNum(0)


//4 
// Составьте программу, которая принимает с клавиатуры целое число и выводит на экран одно из следующих ша(: 
// "положительное", или "отрицательное", или "ноль" – в зависимости от значения числа.

// function funcNum(a){
//   if(a>0){
//     console.log('Число положительное')
//   }
//   else if(a<0){
//     console.log('Число отрицательное')
//   }
//   else if(a==0){
//     console.log('Ноль')
//   }
  
// }
// funcNum(0)


//5 
// Составьте программу, которая принимает с клавиатуры два целых числа и, если первое больше второго, выводит на экран их сумму, 
// если же наоборот – выводит на экран их произведение. В случае же, если числа одинаковы, 
// программа выводит на экран сообщение "числа одинаковые".

// function twoNum(a,b){
//   if(a>b){
//     console.log(a+b);
//   }
//   else if(a<b){
//     console.log(a*b);
//   }
//   else if(a==b){
//     console.log('Числа одинаковые');
//   }
// }
// twoNum(5,3);


//6

// Создайте тег для описания языка JavaScript. Внутри тега пропишите однострочный комментарий с текстом: «Меня не видно».
// <!DOCTYPE html>
// <html>
// <head>
//     <title>Практика JavaScript</title>
// </head>
// <body>
// 	<script>
// 	    // Меня не видно
// 	</script>
// </body>
// </html>


// 7
// Пропишите функцию для вывода информации в консоль. Выведите в консоль сообщение: «Я в консоли».

// <!DOCTYPE html>
// <html>
// <head>
//     <title>Практика JavaScript</title>
// </head>
// <body>
//     <script>
//     console.log("Я в консоли");
//     </script>
// </body>
// </html>